In [ ]:
!pip install pandas

In [ ]:
import os

In [ ]:
os.getcwd()

In [ ]:
import pandas as pd
import numpy as np

# 1.creating a dataframe from an array

## 1.1 OPTION 1

In [ ]:
#creating an array
data = np.array([[1,4],[2,5],[3,6]])

In [ ]:
#creating dataframe
df=pd.DataFrame(data, index=['row1','row2','row3'],columns = ['col1','col2'])

In [ ]:
df

## 1.2 OPTION 2

In [ ]:
#creating an array
data = [[1,4],[2,5],[3,6]]

In [ ]:
#creating dataframe
df=pd.DataFrame(data, index=['row1','row2','row3'],columns = ['col1','col2'])

In [ ]:
df

# 2 Creating a dataframe from a dictionary

In [ ]:
#list used for this example
states= ['california','texas','Florida',"New York"]
population = [39613493,29730311,21944577,19299981]

In [ ]:
# sorting list within a dictionary
dict_states = {'States':states,'Population':population}

In [ ]:
# creating a dataframe
df = pd.DataFrame(dict_states)

In [ ]:
# showing the dataframe
df

In [ ]:
df_population = pd.DataFrame(dict_states)

In [ ]:
df_population

# 3 Creating a dataframe using csv file

In [ ]:
#reading csv file
df_exams=pd.read_csv('StudentsPerformance.csv')

In [ ]:
# reading the first 5 rows
df_exams.head()

In [ ]:
df_exams.tail() #the last 5 rows

In [ ]:
#getting shape attribute
df_exams.shape

In [ ]:
!git init

In [ ]:
!git add .

In [ ]:
!git commit -m "accessing dataframes"

In [ ]:
!git push -u origin main

# 1 Attributes

In [ ]:
# getting access to the shape attribute, shape attribute returns the number of rows and colums in a dataframe in ('rows','columns') format
df_exams.shape

In [ ]:
 #getting access to the index attribute 
df_exams.index

In [ ]:
#getting access to column attribute
df_exams.columns

In [ ]:
#data types of object
df_exams.dtypes

# 2 Methods

In [ ]:
# showing the info of the dataframe
df_exams.info()

In [ ]:
df_exams.describe()

# 3 Functions

In [ ]:
#obtaining the length of the dataframe (no. of rows)
len(df_exams)

In [ ]:
# obtaing the highest index of the dataframe
max(df_exams.index)

In [ ]:
#obtaining the datatype of dataframe
type(df_exams)

In [ ]:
# rounding the values of df
round(df_exams,2)

# Selecting 1 columns

# 1.1 syntax 1

In [ ]:
#selecting a column with [] (prefferred way to select a column)
df_exams['gender']

In [ ]:
# check out the data type of a column
type(df_exams['gender'])

In [ ]:
df_exams['gender'].index

In [ ]:
df_exams['gender'].head()

## 1.2 Syntax 2

In [ ]:
df_exams.gender

In [ ]:
#pitfalls of this syntax
df_exams.math score

In [ ]:
df_exams['math score']

# Selecting 2 or more columns

In [ ]:
# selecting 2 colums using [[]]
df_exams[['gender','math score']]

 # Adding a new column with scalar value

In [ ]:
df_exams['langauge_score']=78

In [ ]:
df_exams['langauge_score']

# adding new value / col uing array

In [ ]:
import numpy as np

In [ ]:
langauge_score= np.arange(0,1000)

In [ ]:
len(langauge_score)

In [ ]:
df_exams['langauge_score'] = langauge_score

In [ ]:
df_exams['langauge_score']

In [ ]:
int_langauge_score=np.random.randint(1,100,size=1000)

In [ ]:
min(int_langauge_score)

In [ ]:
df_exams['langauge_score'] = int_langauge_score

In [ ]:
df_exams['langauge_score']

# Adding new values to the dataframe using methods

## 1.1 assign()

In [ ]:
!git commit -m "assigning new features to existing one using methods"

In [ ]:
!git push -u origin main

In [ ]:
!git init

In [ ]:
!git add .

In [ ]:
import numpy as np

In [ ]:
score1 = np.random.randint(1, 100, size=1000)
score2 = np.random.randint(1, 100, size=1000)

In [ ]:
series1= pd.Series(score1,index=np.arange(0,1000))
series2= pd.Series(score2,index=np.arange(0,1000))

In [ ]:
df_exams.assign(score1=series1, score2=series2)

# insert

In [ ]:
# using insert() to add a column at a specific position
df_exams.insert(1,'test', series1)

In [ ]:
df_exams

# Operations on Dataframes

In [3]:
import pandas as pd

In [4]:
# reading the csv file
df_exams = pd.read_csv('StudentsPerformance.csv')
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

# Math Operations

## Operations in columns

In [5]:
# select a column and calculate total sum
df_exams['math score'].sum()

66089

In [6]:
# count, mean, std, max, and min
df_exams['math score'].count()
df_exams['math score'].mean()
df_exams['math score'].std()
df_exams['math score'].max()
df_exams['math score'].min()

0

In [7]:

# easier calculation with .describe()
df_exams.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [8]:
# calculating the sum in a row
df_exams['math score'] + df_exams['reading score'] + df_exams['writing score']

0      218
1      247
2      278
3      148
4      229
      ...
995    282
996    172
997    195
998    223
999    249
Length: 1000, dtype: int64

In [9]:
# calculating the average score and assigning the result to a new column
df_exams['average'] = (df_exams['math score'] + df_exams['reading score'] + df_exams['writing score'])/3

In [10]:

# showing the dataframe
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,average
0,female,group B,bachelor's degree,standard,none,72,72,74,72.666667
1,female,group C,some college,standard,completed,69,90,88,82.333333
2,female,group B,master's degree,standard,none,90,95,93,92.666667
3,male,group A,associate's degree,free/reduced,none,47,57,44,49.333333
4,male,group C,some college,standard,none,76,78,75,76.333333
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,94.000000
996,male,group C,high school,free/reduced,none,62,55,55,57.333333
997,female,group C,high school,free/reduced,completed,59,71,65,65.000000
998,female,group D,some college,standard,completed,68,78,77,74.333333
999,female,group D,some college,free/reduced,none,77,86,86,83.000000

# Value Counts

In [11]:
# counting gender elements

# len function
len(df_exams['gender'])
# .count() method
df_exams['gender'].count()

1000

In [12]:

# counting gender elements by category
df_exams['gender'].value_counts()

female    518
male      482
Name: gender, dtype: int64

In [13]:

# return the relative frequency (divide all values by the sum of values)
df_exams['gender'].value_counts(normalize=True)

female    0.518
male      0.482
Name: gender, dtype: float64

In [14]:

# counting "parental level of education" elements by category
df_exams['parental level of education'].value_counts()

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

In [15]:
# return the relative frequency and round to 2 decimals
df_exams['parental level of education'].value_counts(normalize=True).round(2)

some college          0.23
associate's degree    0.22
high school           0.20
some high school      0.18
bachelor's degree     0.12
master's degree       0.06
Name: parental level of education, dtype: float64